In [1]:
import pandas as pd
pd.__version__

'0.25.1'

__Wide dataframe__ has a column for each variable. Whereas __long-format dataframe__ has a column for possible variable types & a column for the values of those variables.

## Converting wide-format dataframe to long-format

In [2]:
## Creating a wide-format dataframe

dict = {
    "Student": ['A', 'B', 'C', 'D', 'E'],
    "Maths": [100, 98, 78, 89, 91],
    "Science": [67, 89, 66, 79, 90],
    "History": [89, 78, 59, 90, 92],
    "English": [98, 78, 76, 65, 98],
    "Hindi": [78, 98, 67, 34, 93]
}

wide_df = pd.DataFrame(dict)
wide_df

  Student  Maths  Science  History  English  Hindi
0       A    100       67       89       98     78
1       B     98       89       78       78     98
2       C     78       66       59       76     67
3       D     89       79       90       65     34
4       E     91       90       92       98     93

### [Melt function to change dataframe from wide-form to long-form](https://pandas.pydata.org/pandas-docs/version/0.23.4/generated/pandas.melt.html)

Parameters in the `pd.melt()`:

- __id_vars__: Columns to be used as identifier variable i.e., the values of this columns will be repeated for each column which will be unpivoted to form a long form daataframe.
- __value_vars__: List of columns which will be unpivoted to form rows of a single column and its value transferred to an adjacent column called _value_.

In [3]:
long_df = pd.melt(wide_df, id_vars = ["Student"], value_vars = ["Maths", "Science", "History", "English", "Hindi"])
long_df

   Student variable  value
0        A    Maths    100
1        B    Maths     98
2        C    Maths     78
3        D    Maths     89
4        E    Maths     91
5        A  Science     67
6        B  Science     89
7        C  Science     66
8        D  Science     79
9        E  Science     90
10       A  History     89
11       B  History     78
12       C  History     59
13       D  History     90
14       E  History     92
15       A  English     98
16       B  English     78
17       C  English     76
18       D  English     65
19       E  English     98
20       A    Hindi     78
21       B    Hindi     98
22       C    Hindi     67
23       D    Hindi     34
24       E    Hindi     93

Renaming the columns of long_df.

In [4]:
long_df.columns = ['Student', 'Subjects', 'Marks']
long_df

   Student Subjects  Marks
0        A    Maths    100
1        B    Maths     98
2        C    Maths     78
3        D    Maths     89
4        E    Maths     91
5        A  Science     67
6        B  Science     89
7        C  Science     66
8        D  Science     79
9        E  Science     90
10       A  History     89
11       B  History     78
12       C  History     59
13       D  History     90
14       E  History     92
15       A  English     98
16       B  English     78
17       C  English     76
18       D  English     65
19       E  English     98
20       A    Hindi     78
21       B    Hindi     98
22       C    Hindi     67
23       D    Hindi     34
24       E    Hindi     93